[
  {
    "title": "Mars Climate Orbiter loss caused by an English-to-metric unit mismatch",
    "description": "Interplanetary probe built by Lockheed Martin and operated by NASA/JPL. Thrust-related impulse data were generated on the ground, transmitted to the spacecraft, and consumed by an onboard navigation package. One ground module output pound-force; the flight dynamics software expected newtons. The resulting trajectory error placed the orbiter at roughly 60 km altitude instead of 150 km, leading to atmospheric disintegration on 23 September 1999",
    "objectives": "Require consistent SI units in all telemetry and command interfaces.\r\nAchieve ≥ 95 % independent verification of critical parameter conversions before launch.\r\nAutomated simulation coverage of all maneuver types ≥ 90 %.\r\nCritical defect density ≤ 0.3 per KLOC at final integration.\r\nMean trajectory error ≤ 5 km at periapsis during orbital insertion rehearsals.",
    "roles": "Developer",
    "standards": "IEEE-730",
    "test_plan": "Scope: Navigation, attitude control, and ground-to-space impulse data path.\r\nEnvironment: Monte Carlo orbital mechanics simulator with stochastic thruster-model noise; Hardware-in-the-loop bench for flight computer.\r\nTechniques:\r\n    Stress tests that inject mixed-unit data and out-of-range values.\r\n    End-to-end dress-rehearsal of orbit-insertion timeline with closed-loop flight dynamics.\r\n    Regression run on each build in CI pipeline (GitHub Actions plus NASA Core Flight SW tools).\r\nExit criteria: All simulations show periapsis altitude error ≤ 5 km with 99 % confidence.",
    "defect_management": "Issues logged in Jira with automatic severity triage; unit-mismatch label applied for analytics.\r\nRoot-cause analysis mandatory for Severity 1–2 defects; corrective actions tracked to closure.\r\nWeekly defect burndown reviewed by QA lead and project manager.",
    "reviews": "Formal requirements review verifies consistent unit definitions across ICDs.\r\nDesign and code inspections follow IEEE 1028 checklists; at least two independent reviewers.\r\nQuarterly SQA audit examines compliance with this plan and updates risk register accordingly.",
    "supplier_control": "Only suppliers with ISO 9001 certification and demonstrated spaceflight heritage are qualified.\r\nContracts mandate delivery of interface control documents with explicit unit specifications.\r\nSupplier software must pass agency V&V prior to integration.\r\nPerformance against SLAs (defect resolution time, documentation quality) monitored monthly.",
    "references": "Euler, E., Jolly, S. D., & Curtis, H. H. (2001). The failures of the Mars Climate Orbiter and Mars Polar Lander: A perspective from the people involved. In AAS Guidance and Control Conference (pp. 635-655). American Astronautical Society. https://www.researchgate.net/publication/343702446_Mars_Missions_Failure_Report_Assortment_Review_and_Conspectus\r\nNational Aeronautics and Space Administration. (1999). Mars Climate Orbiter Mishap Investigation Board Phase I Report. NASA.https://llis.nasa.gov/llis_lib/pdf/1009464main1_0641-mr.pdf\r\nOberg, J. (1999, December 1). Why the Mars probe went off course. IEEE Spectrum, 36(12), 34-39. https://spectrum.ieee.org/why-the-mars-probe-went-off-course",
    "purpose": "Define quality activities that prevent unit‐related data errors and other integration defects in future deep-space navigation software."
  }
]